Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: The nice thing about this is that applying a patch from an e-mail generated with `format-patch` preserves all the commit information properly, as you’ll see more of in the next section when you apply these commits:
es: Lo bonito de este procedimiento es que, al aplicar un parche desde un correo electrónico generado por `format-patch`, se preserva íntegramente la información de la confirmación de cambios (commit). Lo veremos más adelante, en la próxima sección, cuando veamos como aplicarlos:

source: You can either run `git submodule update` to reclone, or you can move your `/tmp/rack` directory back into the empty directory.
es: Ante lo cual, será necesario lanzar`git submodule update` para volver a clonarla; o, si no, volver a restaurar la carpeta `/tmp/rack` de vuelta sobre la carpeta vacia.

source: The `post-update` hook that comes with Git by default runs the appropriate command (`git update-server-info`) to make HTTP fetching and cloning work properly.
es: El enganche 'post-update' que viene de serie con Git se encarga de lanzar el comando adecuado ('git update-server-info') para hacer funcionar la recuperación (fetching) y el clonado (cloning) vía HTTP.

source: With this method, you can quickly get a read/write Git server up and running for a handful of developers.
es: Con este método, puedes preparar rápidamente un servidor Git con acceso de lectura/escritura para un grupo de desarrolladores.

source: If the topics still need work, they’re merged into `pu` instead.
es: Si las funcionalidades necesitan ser más trabajadas, se fusionan (merge) en la rama 'pu'.

source: This command is run when you push to this repository over SSH; then, other people can clone via something like
es: Este comando se lanza automáticamente cuando envias (push) a este repositorio vía SSh; de tal forma que otras personas puedan clonarlo usando un comando tal que:

source: Now you’ll explore a number of very powerful things that Git can do that you may not necessarily use on a day-to-day basis but that you may need at some point.
es: En este capítulo se van a explorar unas cuantas tareas avanzadas de Git. Tareas que, aunque no se utilizan en el trabajo del día a día, en algún momento pueden ser necesarias.

source: To push a new stash onto your stack, run `git stash`:
es: Utilizando el comando 'git stash' y enviando un nuevo grupo de cambios a la pila de guardado rápido:

source: People can fork a project and push to it, and the main project maintainer can pull in those changes by adding them as remotes and merging in their work.
es: La gente puede bifurcar (fork) un proyecto y enviar (push) sobre su propia copia. El gestor del proyecto principal, puede recuperar (pull) esos cambios añadiendo las copias como remotos y fusionando (merge) el trabajo en ellas contenido.

source: In this case, you remove a file called passwords.txt from every snapshot, whether it exists or not.
es: En esta ocasión, se eliminará un archivo llamado passwords.txt de todas y cada una de las instantáneas (snapshot) almacenadas, tanto si este existe como si no.

source: Let’s walk through setting up SSH access on the server side.
es: Vamos a avanzar en los ajustes de los accesos SSH en el lado del servidor.

source: You can use that incantation to grab the commit message from each commit that is trying to be pushed and exit if you see anything that doesn’t match.
es: Puedes usar este "hechizo mágico" para coger el mensaje de cada confirmación de cambios que se está enviando y salir si localizas algo que no cuadra en alguno de ellos.

source: If you have more developers or a larger project, you’ll probably want to use at least a two-phase merge cycle.
es: Teniendo muchos desarrolladores o proyectos muy grandes, muy posiblemente desees utilizar un ciclo con por lo menos dos fases.

source: On Linux machines, `lighttpd` is often installed, so you may be able to get it to run by typing `git instaweb` in your project directory.
es: En las máquinas Linux, 'lighttpd' suele estar habitualmente instalado. Por lo que tan solo has de activarlo lanzando el comando 'git instaweb', estando en la carpeta de tu proyecto.

source: If you have a branch named `serverfix` that you want to work on with others, you can push it up the same way you pushed your first branch.
es: Si tienes una rama llamada 'serverfix', con la que vas a trabajar en colaboración; puedes llevarla al remoto de la misma forma que llevaste tu primera rama.

source: #### Changing E-Mail Addresses Globally ####
es: #### Cambiando direcciones de correo-e de forma global ####

source: This is because SSH access to servers is already set up in most places — and if it isn’t, it’s easy to do.
es: Debido a disponibilidad en la mayor parte de los servidores; (pero, si no lo estuviera disponible, además es sencillo habilitarlo).

source: Anything that has merge conflicts and hasn’t been resolved is listed as unmerged.
es: Todo aquello que sea conflictivo y no se haya podido resolver, se marca como "sin fusionar" (unmerged).

source: When you’ve decided to cut a release, you’ll probably want to drop a tag so you can re-create that release at any point going forward.
es: Cuando decides dar por preparada una versión, probablemente querrás etiquetar dicho punto de algún modo; de tal forma que, más adelante, puedas volver a generar esa versión en cualquier momento.

source: Next, you look for what the HEAD reference is so you know what to check out when you’re finished:
es: Lo siguiente es mirar cual es la referencia a HEAD, de tal forma que puedas saber el punto a activar (checkout) cuando termines:

source: Git will also automatically remove commits that did not affect the subdirectory.
es: Y, además, Git elimina automáticamente todas las confirmaciones de cambio (commits) que no afectaban a dicha subcarpeta.

source: Then, you e-mail that guy and yell at him.
es: Para enviarle un correo-e y avisarle de su despiste.

source: You can turn on this functionality with the `core.autocrlf` setting.
es: Puedes activar esta funcionalidad con el parámetro 'core.autocrlf'.

source: Installing Gitosis isn’t the simplest task ever, but it’s not too difficult.
es: Instalar Gitosis no es precisamente sencillo. Pero tampoco demasiado complicado.

source: In order to provide a public key, each user in your system must generate one if they don’t already have one.
es: Y, para ello, cada usuario del sistema ha de generarse una, si es que no la tiene ya.

source: Also note the `^4832fe2` commit lines, which designate that those lines were in this file’s original commit.
es: En el caso de las líneas con la confirmación de cambios `^4832fe2`, merece comentar que son aquellas presentes en el archivo cuando se hizo la confirmación de cambios original;

source: So, if the Rack project updates, you can pull in upstream changes by switching to that branch and pulling:
es: De tal forma que, si se actualiza el proyecto Rack, se pueden integrar los cambios aguas arriba simplemente cambiando a esa rama y recuperando:

source: Jessica’s history after committing on a feature branch.
es: El historial de Jessica después de confirmar cambios en una rama puntual.

source: The last hook to run during a `git am` operation is `post-applypatch`.
es: El último punto de enganche que se activa durante una operación 'git am' es el punto 'post-applypatch'.

source: Other possible settings are false, which never colors the output, and always, which sets colors all the time, even if you’re redirecting Git commands to a file or piping them to another command.
es: Otros ajustes posibles son "false", para indicar a Git no colorear nunca ninguno de sus resultados; y "always", para indicar colorear siempre, incluso cuando se redirija la salida a un archivo o a otro comando.

source: You’ll learn more about what this means in a bit.
es: En breve lo veremos con más detalle.

source: By default, a user’s SSH keys are stored in that user’s `~/.ssh` directory.
es: Por defecto, las claves de cualquier usuario SSH se guardan en la carpeta `~/.ssh` de dicho usuario.

source: I’ll use the Mac path for the executable; in other systems, it will be where your `p4merge` binary is installed.
es: En estos ejemplos, voy a utilizar caminos y nombres Mac para los ejecutables; en otros sistemas, tendrás que sustituirlos por los correspondientes donde tengas instalado 'p4merge'.

source: Now, store some text in your Git database:
es: Luego, guarda algo de texto en la base de datos de Git:

source: The octopus merge can handle multiple branches but is more cautious to avoid difficult conflicts, so it’s chosen as the default strategy if you’re trying to merge more than two branches.
es: La fusión-tipo-pulpo puede manejar multiples ramas, pero es mucho mas cuidadosa para evitar incurrir en complejos conflictos; y es por eso que se utiliza en los intentos de fusionar más de dos ramas.

source: In more complex cases, the client supports `multi_ack` or `side-band` capabilities; but this example shows you the basic back and forth used by the smart protocol processes.
es: En casos más complejos, el cliente explota las capacidades de `multi_ack` (multiples confirmaciones) o `side-band` (banda lateral). Pero este ejemplo muestra los intercambios básicos empleados en los protocolos inteligentes.

source: Now you have a new repository on GitHub (see Figure 4-6).
es: Y ya tienes un nuevo repositorio en GitHub (ver Figura 4-6)

source: Further paragraphs come after blank lines.
es: Los siguientes párrafos van tras la línea en blanco.

source: The configuration options recognized by Git fall into two categories: client side and server side.
es: Las opciones de configuración reconocidas por Git pueden distribuirse en dos grandes categorias: las del lado cliente y las del lado servidor.

source: The `color.ui = true` setting is almost always what you’ll want to use.
es: Habitualmente, se trabajará con el ajuste 'color.ui = true'.

source: The file is meant to be consumed by a machine.
es: Estos son archivos destinados a ser tratados de forma automatizada.

source: Insert 18333fig0301.png Figure 3-1.
es: Insert 18333fig0301.png Figura 3-1.

source: An annotated tag is more complex, however.
es: Sin embargo, una etiqueta anotativa es más compleja.

source: This is called having a detached head — it means the HEAD file points directly to a commit, not to a symbolic reference.
es: Es lo que se conoce como "trabajar con cabecera desconectada" --es decir, el archivo HEAD apunta directamente a una confirmación de cambios (commit), y no a una referencia simbólica--.

source: This is a relatively expensive operation and may add a lot of time to each push, depending on the size of the repository or the push.
es: Es una operación costosa, que, dependiendo del tamaño del repositorio, puede llegar a añadir mucho tiempo a cada operación de envio (push).

source: For example, the most recent tree in the simplegit project may look something like this:
es: Por ejemplo, el árbol que hemos utilizado recientemente en el proyecto simplegit, puede resultar algo así como:

source: Consider an example of doing some work (on `master`), branching off for an issue (`iss91`), working on it for a bit, branching off the second branch to try another way of handling the same thing (`iss91v2`), going back to your master branch and working there for a while, and then branching off there to do some work that you’re not sure is a good idea (`dumbidea` branch).
es: Por ejemplo, puedes realizar cierto trabajo en la rama 'master', ramificar para un problema concreto (rama 'iss91'), trabajar en él un rato, ramificar a una segunda rama para probar otra manera de resolverlo (rama 'iss92v2'), volver a la rama 'master' y trabajar un poco más, y, por último, ramificar temporalmente para probar algo de lo que no estás seguro (rama 'dumbidea').

source: The third type of reference that you’ll see is a remote reference.
es: El tercer tipo de referencia que puedes observar es la referencia remota.

source: What is the "word" filter?
es: ¿Qué es el filtro "word"?

source: You must look at each commit being pushed up, see if that string is in the commit message, and, if the string is absent from any of the commits, exit non-zero so the push is rejected.
es: Has de mirar en cada confirmación de cambios (commit) recibida, para ver si contiene ese texto; y, si no lo trae, salir con un código distinto de cero, de tal forma que el envio (push) sea rechazado.

source: You stick the bare repository copy somewhere everyone has shared access to and set the read/write permissions as you would for any other shared directory.
es: Simplemente pones el repositorio básico en algún lugar donde todos tengan acceso a él y ajustas los permisos de lectura/escritura según proceda, tal y como lo harías para preparar cualquier otra carpeta compartida.

source: The GitHub plan page.
es: La página de planes GitHub.

source: To clone a repository like this or to add one as a remote to an existing project, use the path to the repository as the URL.
es: Para clonar un repositorio como estos, o para añadirlo como remoto a un proyecto ya existente, usa el camino (path) del repositorio como su URL.

source: First, you’ll probably want to clone the main repository, create a topic branch for the patch or patch series you’re planning to contribute, and do your work there.
es: Para empezar, problemente desees clonar el repositorio principal, crear una rama puntual para el parche con el que piensas contribuir, y ponerte a trabajar sobre ella.

source: This means `master` almost always moves forward, `next` is rebased occasionally, and `pu` is rebased even more often (see Figure 5-25).
es: Esto significa que 'master' prácticamente siempre avanza; 'next' se reorganiza (rebase) de vez en cuando; y 'pu' es reorganizada con más frecuencia (ver Figura 5-25).

source: Let’s take a minute to look at how Git stores its objects.
es: Vamos a hechar un vistazo a cómo Git almacena sus objetos.

source: Short (50 chars or less) summary of changes
es: Un resumen de cambios, corto (50 caracteres o menos).

source: The hooks are all stored in the `hooks` subdirectory of the Git directory.
es: Los puntos de enganche se guardan en la subcarpeta 'hooks' de la carpeta Git.

source: You should also be able to share your branches by pushing them to a shared server, working with others on shared branches and rebasing your branches before they are shared.
es: También conocerás cómo compatir tus ramas enviandolas (push) a un servidor compartido, cómo trabajar colaborativamente en ramas compartidas, y cómo reorganizar (rebase) tus ramas antes de compartirlas.

source: At the bottom of the instructions page is a link to a Subversion import.
es: All fondo de la página de instrucciones, tienes un enlace "Subversion import".

source: It’s important to note that the reflog information is strictly local — it’s a log of what you’ve done in your repository.
es: Es importante destacar la estricta localidad de la información en el registro de referencia. Es un registro que se va componiendo en cada repositorio según se va trabajando en él.

source: #### Enforcing a User-Based ACL System ####
es: #### Implementando un sistema de control de accesos basado en usuario ####

source: It’s easiest to push the remote branch you’re working on up to your repository, rather than merging into your master branch and pushing that up.
es: Es más sencillo enviar (push) directamente la rama puntual sobre la que estás trabajando, en lugar de fusionarla (merge) previamente con tu rama principal y enviar esta última.

source: It’s easiest to use a Linux server for it — these examples use a stock Ubuntu 8.10 server.
es: Es más sencillo hacerlo si utilizas un servidor Linux --estos ejemplos se han hecho sobre un servidor Ubuntu 8.10--.

source: They can use that key to verify all your signed tags.
es: De esta forma, pueden utilizar esa clave para verificar todas las etiquetas que firmes.

source: You’ll learn more about `read-tree` and its friends in Chapter 9, but for now know that it reads the root tree of one branch into your current staging area and working directory.
es: Se verá más en detalle el comando `read-tree` y sus acompañantes en el capítulo 9. Pero por ahora, basta con saber que este comando se encarga de leer el árbol raiz de una rama en el área de preparación (staging area) y carpeta de trabajo (working directory) actuales.

source: However, scripts and hosted services may make this easier — it depends largely on how you develop and how your contributors develop.
es: De todas formas, los scripts y los servicios albergados pueden hacerte la vida más facil en esto, --todo depende de cómo desarrolles tú y de como desarrollan las personas que colaboran contigo--.

source: You can see that Git re-modifies the files you uncommitted when you saved the stash.
es: Como se ve en la salida del comando, Git vueve a aplicar los correspondientes cambios en los archivos que estaban modificados. Pero no conserva la información de lo que estaba o no estaba añadido al área de preparación.

source: Thus, I’ve made this discussion the last chapter in the book so you could read it early or later in your learning process.
es: Por ello, lo he puesto al final del libro; de tal forma que puedas leerlo antes o después, en cualquier momento, a lo largo de tu proceso de aprendizaje.

source: If you don’t want to go through all of the work involved in setting up your own Git server, you have several options for hosting your Git projects on an external dedicated hosting site.
es: Si no quieres realizar todo el trabajo de preparar tu propio servidor Git, tienes varias opciones para alojar tus proyectos Git en una ubicación externa dedicada.

source: The maintainer of the Git project has solved this issue by including their public key as a blob in the repository and then adding a tag that points directly to that content.
es: Los gestores del proyeto Git ha resuelto este problema incluyendo sus claves públicas como un objeto en el repositorio, añadiendo luego una etiqueta apuntando directamente a dicho contenido.

source: For example, if your contributor sends you two patches and you create a branch called `contrib` and applied those patches there, you can run this:
es: Por ejemplo, si la persona colaboradora te envia dos parches y tu creas una rama 'contrib' donde aplicar dichos parches; puedes lanzar algo como esto:

source: Git can handle this by auto-converting CRLF line endings into LF when you commit, and vice versa when it checks out code onto your filesystem.
es: Git la maneja autoconvirtiendo los finales CRLF en LF al hacer confirmaciones de cambios (commit); y, viceversa, al extraer código (checkout) a la carpeta de trabajo.

source: ### Commit Ranges ###
es: ### Referecias a un rango de confirmaciones de cambios ###

source: You can set it to `more` or to your favorite pager (by default, it’s `less`), or you can turn it off by setting it to a blank string:
es: Puedes ajustarlo para que utilice 'more' o tu paginador favorito, (por defecto, se utiliza 'less'); o puedes anular la paginación si le asignas una cadena vacia.

source: The blank line separating the summary from the body is critical (unless you omit the body entirely); tools like rebase can get confused if you run the two together.
es: La línea en blanco separando el resumen del cuerpo es crítica (a no ser que se omita totalmente el cuerpo); algunas herramientas como 'rebase' pueden tener problemas si no los separas adecuadamente.

source: ## Git Daemon ##
es: ## El demonio Git ##

source: To do so, you’ll likely have to edit your `/etc/passwd` file:
es: Has de editar el archivo '/etc/passwd':

source: You then need to add in this new repository URL as a second remote, in this case named `myfork`:
es: Tendrás que añadir la URL a este nuevo repositorio como un segundo remoto, y en este caso lo denominaremos 'myfork':

source: These options apply to the git rebase option as well.
es: Estas opciones se pueden aplicar también al comando 'git rebase'.

source: If you’re set up correctly, you can try to SSH into your server as the user for which you added the public key to initialize Gitosis.
es: Si lo has configurado todo correctamente, puedes intentar conectarte, vía SSH, a tu servidor como el usuario con cuya clave pública has inicializado Gitosis.

source: If you want to place your repositories on a server that doesn’t have accounts for everyone on your team whom you want to have write access, then you must set up SSH access for them.
es: Si deseas colocar los repositorios en un servidor donde no todas las personas de tu equipo tengan cuentas de acceso, tendrás que dar acceso SSH a aquellas que no lo tengan.

source: You can set up three client-side hooks for an e-mail–based workflow.
es: Tienes disponibles tres puntos de enganche en el lado cliente para interactuar con el flujo de trabajo de correo electrónico.

source: This effectively makes nice text-based versions of your Word files before attempting to diff them.
es: Esto prepara versiones texto de los archivos Word, antes de intentar compararlos.

source: If you have it available, this is a good time to add your public SSH key as well.
es: Si la tuvieras, es también un buen momento para añadir tu clave pública SSH.

source: In this case, you’re still on master.
es: En este caso, en la rama 'master'.

source: ### GitHub Summary ###
es: ### Resumen de GitHub ###

source: The Git project requires that the more detailed explanation include your motivation for the change and contrast its implementation with previous behavior — this is a good guideline to follow.
es: El proyecto Git obliga a incluir una explicación detallada; incluyendo tus motivaciones para los cambios realizados; y comentarios sobre las diferencias, tras su implementación, respecto del comportamiento anterior del programa. Esta recomendación es una buena regla a seguir.

source: First, you again tell it the scope of the bisect by providing the known bad and good commits.
es: Primero, como siempre, se indica el alcance de la búsqueda indicando las aquellas confirmaciones de cambio conocidas donde el proyecto estaba mal y donde estaba bien.

source: Every time anyone clones this repository, they will have to clone all 2MB just to get this tiny project, because you accidentally added a big file.
es: A partir de este momento, cada vez que alguien haga un clón de este repositorio, se verá obligado a copiar 2 MB para un proyecto tan simple. Y todo porque tu añadiste accidentalmente un archivo enorme en algún momento.

source: You can run rebase interactively by adding the `-i` option to `git rebase`.
es: Este modo interactivo se activa utilizando la opción `-i` en el comando `git rebase`.

source: If you aren’t working with a person consistently but still want to pull from them in this way, you can provide the URL of the remote repository to the `git pull` command.
es: Si no trabajas habitualmente con una persona, pero deseas recuperar de ella por esta vía, puedes indicar directamente el URL del repositorio remoto en el comando 'git pull'.

source: This way, you can export a snapshot or build and name it something understandable to people.
es: De esta forma, puedes exportar una instantánea u obtener un nombre comprensible por cualquier persona.

source: Many options are useful only in edge cases that I won’t go over here.
es: No vamos a revisar aquellas opciones utilizadas solo en casos muy especiales.

source: You must rewrite all the commits downstream from `6df76` to fully remove this file from your Git history.
es: Para borrar realmente ese archivo de tu historial Git, has de reescribir todas las confirmaciones de cambio aguas abajo de `6df76`.
